CASES/FWV2/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0104208;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0104208;
    }
    outlet
    {
        type            zeroGradient;
    }
    "FW01V3"
    {
        type            kqRWallFunction;
        value           uniform 0.0104208;
    }
    ground
    {
        type            kqRWallFunction;
        value           uniform 0.0104208;
    }
    farField
    {
        type            zeroGradient;
    }
    symmetry
    {
        type            symmetry;
    }
}


// ************************************************************************* //
