CASES/FWV2/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0001516;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.0001516;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.0001516;
    }
    "FW01V3"
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    ground
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    farField
    {
        type            calculated;
        value           uniform 0.0001516;
    }
    symmetry
    {
        type            symmetry;
    }
}


// ************************************************************************* //
