CASES/FWV2/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
    FW01V3.stl
    {
        extractionMethod    extractFromSurface;
        extractFromSurfaceCoeffs
        {
            includedAngle   150;
        }
        subsetFeatures
        {
            nonManifoldEdges    yes;
            openEdges           yes;
        }
        writeObj            no;
    }


// ************************************************************************* //
